; ModuleID = 'qh1u02u5cnh999m'
source_filename = "qh1u02u5cnh999m"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "arm64-apple-macosx11.0.0"

%"core::panic::panic_info::PanicInfo" = type { { {}*, [3 x i64]* }, i64*, %"core::panic::location::Location"*, i8, [7 x i8] }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }

; Function Attrs: noreturn nounwind
define hidden void @rust_begin_unwind(%"core::panic::panic_info::PanicInfo"* align 8 %_panic) unnamed_addr #0 !dbg !19 {
start:
  %_panic.dbg.spill = alloca %"core::panic::panic_info::PanicInfo"*, align 8
  store %"core::panic::panic_info::PanicInfo"* %_panic, %"core::panic::panic_info::PanicInfo"** %_panic.dbg.spill, align 8
  call void @llvm.dbg.declare(metadata %"core::panic::panic_info::PanicInfo"** %_panic.dbg.spill, metadata !193, metadata !DIExpression()), !dbg !194
  br label %bb1, !dbg !195

bb1:                                              ; preds = %bb1, %start
  br label %bb1, !dbg !195
}

; Function Attrs: nofree nosync nounwind readnone speculatable willreturn
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

attributes #0 = { noreturn nounwind "frame-pointer"="non-leaf" "target-cpu"="apple-a14" }
attributes #1 = { nofree nosync nounwind readnone speculatable willreturn }

!llvm.module.flags = !{!0, !1, !2, !3}
!llvm.dbg.cu = !{!4}

!0 = !{i32 7, !"PIC Level", i32 2}
!1 = !{i32 7, !"PIE Level", i32 2}
!2 = !{i32 2, !"Dwarf Version", i32 2}
!3 = !{i32 2, !"Debug Info Version", i32 3}
!4 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !5, producer: "clang LLVM (rustc version 1.64.0 (a55dd71d5 2022-09-19))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !6)
!5 = !DIFile(filename: "src/main.rs/@/qh1u02u5cnh999m", directory: "/Users/akram/Documents/DCS/bsc-project/test_files/rust/test_app")
!6 = !{!7}
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !9, file: !8, baseType: !13, size: 8, align: 8, flags: DIFlagEnumClass, elements: !14)
!8 = !DIFile(filename: "<unknown>", directory: "")
!9 = !DINamespace(name: "v1", scope: !10)
!10 = !DINamespace(name: "rt", scope: !11)
!11 = !DINamespace(name: "fmt", scope: !12)
!12 = !DINamespace(name: "core", scope: null)
!13 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!19 = distinct !DISubprogram(name: "panic", linkageName: "rust_begin_unwind", scope: !21, file: !20, line: 7, type: !22, scopeLine: 7, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !35, retainedNodes: !192)
!20 = !DIFile(filename: "src/main.rs", directory: "/Users/akram/Documents/DCS/bsc-project/test_files/rust/test_app", checksumkind: CSK_MD5, checksum: "b1ec4a31cd3157a77ff7d1b11914c64d")
!21 = !DINamespace(name: "test_app", scope: null)
!22 = !DISubroutineType(types: !23)
!23 = !{null, !24}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::panic_info::PanicInfo", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanicInfo", scope: !26, file: !8, size: 320, align: 64, elements: !28, templateParams: !35, identifier: "63651147e34636bc318b3bc91db66c6f")
!26 = !DINamespace(name: "panic_info", scope: !27)
!27 = !DINamespace(name: "panic", scope: !12)
!28 = !{!29, !42, !182, !190}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !25, file: !8, baseType: !30, size: 128, align: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn core::any::Any + core::marker::Send)", file: !8, size: 128, align: 64, elements: !31, templateParams: !35, identifier: "a01ecae4315875ce46756d21f21becce")
!31 = !{!32, !36}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !30, file: !8, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::any::Any + core::marker::Send)", file: !8, align: 8, elements: !35, identifier: "acd12d5f6a031b2a5e3bf5b7e1d55989")
!35 = !{}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !30, file: !8, baseType: !37, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !38, size: 64, align: 64, dwarfAddressSpace: 0)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 192, align: 64, elements: !40)
!39 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!40 = !{!41}
!41 = !DISubrange(count: 3, lowerBound: 0)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !25, file: !8, baseType: !43, size: 64, align: 64, offset: 128)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&core::fmt::Arguments>", scope: !44, file: !8, size: 64, align: 64, elements: !45, templateParams: !35, identifier: "a3acba6571a7d3c7c2a5d2499209fae1")
!44 = !DINamespace(name: "option", scope: !12)
!45 = !{!46}
!46 = !DICompositeType(tag: DW_TAG_variant_part, scope: !43, file: !8, size: 64, align: 64, elements: !47, templateParams: !35, identifier: "fdd48e291bf5601f96752cdf5cb08048", discriminator: !181)
!47 = !{!48, !177}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !46, file: !8, baseType: !49, size: 64, align: 64, extraData: i64 0)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !43, file: !8, size: 64, align: 64, elements: !35, templateParams: !50, identifier: "5034c453c373a1adf51d355be3e0f411")
!50 = !{!51}
!51 = !DITemplateTypeParameter(name: "T", type: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Arguments", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !11, file: !8, size: 384, align: 64, elements: !54, templateParams: !35, identifier: "5c626958b48b5eccaf984881db85d842")
!54 = !{!55, !66, !114}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !53, file: !8, baseType: !56, size: 128, align: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !8, size: 128, align: 64, elements: !57, templateParams: !35, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!57 = !{!58, !65}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !56, file: !8, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64, dwarfAddressSpace: 0)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !8, size: 128, align: 64, elements: !61, templateParams: !35, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!61 = !{!62, !64}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !60, file: !8, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !60, file: !8, baseType: !39, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !56, file: !8, baseType: !39, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !53, file: !8, baseType: !67, size: 128, align: 64, offset: 128)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !44, file: !8, size: 128, align: 64, elements: !68, templateParams: !35, identifier: "1394868a35f3e34acb06ccc1525399a5")
!68 = !{!69}
!69 = !DICompositeType(tag: DW_TAG_variant_part, scope: !67, file: !8, size: 128, align: 64, elements: !70, templateParams: !35, identifier: "2ae1a00feac9de1f1248c7ea47438d4", discriminator: !113)
!70 = !{!71, !109}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !69, file: !8, baseType: !72, size: 128, align: 64, extraData: i64 0)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !67, file: !8, size: 128, align: 64, elements: !35, templateParams: !73, identifier: "bea5aaf57d77054c34563d021b5d5fb")
!73 = !{!74}
!74 = !DITemplateTypeParameter(name: "T", type: !75)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !8, size: 128, align: 64, elements: !76, templateParams: !35, identifier: "dddd31e5f63e2447d904e2c1dab1951b")
!76 = !{!77, !108}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !75, file: !8, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !9, file: !8, size: 448, align: 64, elements: !80, templateParams: !35, identifier: "298666e05b946452419eb5579e6a00a7")
!80 = !{!81, !82}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !79, file: !8, baseType: !39, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !79, file: !8, baseType: !83, size: 384, align: 64, offset: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !9, file: !8, size: 384, align: 64, elements: !84, templateParams: !35, identifier: "f85276ace3423c6b039dd7d2950570c")
!84 = !{!85, !87, !88, !90, !107}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !83, file: !8, baseType: !86, size: 32, align: 32, offset: 256)
!86 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !83, file: !8, baseType: !7, size: 8, align: 8, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !83, file: !8, baseType: !89, size: 32, align: 32, offset: 288)
!89 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !83, file: !8, baseType: !91, size: 128, align: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !9, file: !8, size: 128, align: 64, elements: !92, templateParams: !35, identifier: "601ae7658547a5f1f1a50ee3e92f575a")
!92 = !{!93}
!93 = !DICompositeType(tag: DW_TAG_variant_part, scope: !91, file: !8, size: 128, align: 64, elements: !94, templateParams: !35, identifier: "22faf209e387171d53ac1f0079dd336a", discriminator: !105)
!94 = !{!95, !99, !103}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !93, file: !8, baseType: !96, size: 128, align: 64, extraData: i64 0)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !91, file: !8, size: 128, align: 64, elements: !97, templateParams: !35, identifier: "265c449839d74c45b297519381b0633e")
!97 = !{!98}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !96, file: !8, baseType: !39, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !93, file: !8, baseType: !100, size: 128, align: 64, extraData: i64 1)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !91, file: !8, size: 128, align: 64, elements: !101, templateParams: !35, identifier: "5811d582b216d9f2ecab75474cf2c57e")
!101 = !{!102}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !100, file: !8, baseType: !39, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !93, file: !8, baseType: !104, size: 128, align: 64, extraData: i64 2)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !91, file: !8, size: 128, align: 64, elements: !35, identifier: "64d555068d5a818b1be41e1d24e0a125")
!105 = !DIDerivedType(tag: DW_TAG_member, scope: !91, file: !8, baseType: !106, size: 64, align: 64, flags: DIFlagArtificial)
!106 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !83, file: !8, baseType: !91, size: 128, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !75, file: !8, baseType: !39, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !69, file: !8, baseType: !110, size: 128, align: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !67, file: !8, size: 128, align: 64, elements: !111, templateParams: !73, identifier: "8e40fc4f7be5051cb59e6a7a62f37f6b")
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !110, file: !8, baseType: !75, size: 128, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, scope: !67, file: !8, baseType: !106, size: 64, align: 64, flags: DIFlagArtificial)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !53, file: !8, baseType: !115, size: 128, align: 64, offset: 256)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !8, size: 128, align: 64, elements: !116, templateParams: !35, identifier: "2f0bd170c79074ad2b68edf2500f111a")
!116 = !{!117, !176}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !115, file: !8, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64, dwarfAddressSpace: 0)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !11, file: !8, size: 128, align: 64, elements: !120, templateParams: !35, identifier: "5a90a34361244f31d9a3f6273d130a85")
!120 = !{!121, !125}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !119, file: !8, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !123, size: 64, align: 64, dwarfAddressSpace: 0)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !124, file: !8, align: 8, elements: !35, identifier: "5696c7308e8c6c798034d3aa41d87d4")
!124 = !DINamespace(name: "{extern#0}", scope: !11)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !119, file: !8, baseType: !126, size: 64, align: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !127, size: 64, align: 64, dwarfAddressSpace: 0)
!127 = !DISubroutineType(types: !128)
!128 = !{!129, !122, !148}
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !130, file: !8, size: 8, align: 8, elements: !131, templateParams: !35, identifier: "4a551f2747a44dabead80acda85bb61c")
!130 = !DINamespace(name: "result", scope: !12)
!131 = !{!132}
!132 = !DICompositeType(tag: DW_TAG_variant_part, scope: !129, file: !8, size: 8, align: 8, elements: !133, templateParams: !35, identifier: "cb375700f3604eff9a5da1af5502090c", discriminator: !147)
!133 = !{!134, !143}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !132, file: !8, baseType: !135, size: 8, align: 8, extraData: i64 0)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !129, file: !8, size: 8, align: 8, elements: !136, templateParams: !139, identifier: "94faea5b92441e63d8342ccc6ddf936e")
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !135, file: !8, baseType: !138, align: 8, offset: 8)
!138 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!139 = !{!140, !141}
!140 = !DITemplateTypeParameter(name: "T", type: !138)
!141 = !DITemplateTypeParameter(name: "E", type: !142)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !11, file: !8, align: 8, elements: !35, identifier: "ad97fe84abc9fe1bc6f76a3e6f98a8c3")
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !132, file: !8, baseType: !144, size: 8, align: 8, extraData: i64 1)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !129, file: !8, size: 8, align: 8, elements: !145, templateParams: !139, identifier: "89dfe10464e8f19e7d0749cb9cc04f3a")
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !144, file: !8, baseType: !142, align: 8, offset: 8)
!147 = !DIDerivedType(tag: DW_TAG_member, scope: !129, file: !8, baseType: !13, size: 8, align: 8, flags: DIFlagArtificial)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !149, size: 64, align: 64, dwarfAddressSpace: 0)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !11, file: !8, size: 512, align: 64, elements: !150, templateParams: !35, identifier: "17230c4d5c473143a3635c890170b9c3")
!150 = !{!151, !152, !153, !154, !168, !169}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !149, file: !8, baseType: !89, size: 32, align: 32, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !149, file: !8, baseType: !86, size: 32, align: 32, offset: 416)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !149, file: !8, baseType: !7, size: 8, align: 8, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !149, file: !8, baseType: !155, size: 128, align: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !44, file: !8, size: 128, align: 64, elements: !156, templateParams: !35, identifier: "81f07469aef9424455541450e9c5a96")
!156 = !{!157}
!157 = !DICompositeType(tag: DW_TAG_variant_part, scope: !155, file: !8, size: 128, align: 64, elements: !158, templateParams: !35, identifier: "5a843ebdd6845123fa00f5e38e04e97e", discriminator: !167)
!158 = !{!159, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !157, file: !8, baseType: !160, size: 128, align: 64, extraData: i64 0)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !155, file: !8, size: 128, align: 64, elements: !35, templateParams: !161, identifier: "c788ca12ecfc279dd9d180811e2a4706")
!161 = !{!162}
!162 = !DITemplateTypeParameter(name: "T", type: !39)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !157, file: !8, baseType: !164, size: 128, align: 64, extraData: i64 1)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !155, file: !8, size: 128, align: 64, elements: !165, templateParams: !161, identifier: "53832b59d1f89f38ea048fc994bf0b2e")
!165 = !{!166}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !164, file: !8, baseType: !39, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, scope: !155, file: !8, baseType: !106, size: 64, align: 64, flags: DIFlagArtificial)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !149, file: !8, baseType: !155, size: 128, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !149, file: !8, baseType: !170, size: 128, align: 64, offset: 256)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !8, size: 128, align: 64, elements: !171, templateParams: !35, identifier: "84ed12813d2390a81742061de67f72e")
!171 = !{!172, !175}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !170, file: !8, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64, dwarfAddressSpace: 0)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !8, align: 8, elements: !35, identifier: "bcdf9bcd42c577188603b9f7cfd737d6")
!175 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !170, file: !8, baseType: !37, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !115, file: !8, baseType: !39, size: 64, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !46, file: !8, baseType: !178, size: 64, align: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !43, file: !8, size: 64, align: 64, elements: !179, templateParams: !50, identifier: "80ae3b19cd702abc9997559abc14042d")
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !178, file: !8, baseType: !52, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, scope: !43, file: !8, baseType: !106, size: 64, align: 64, flags: DIFlagArtificial)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !25, file: !8, baseType: !183, size: 64, align: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !184, size: 64, align: 64, dwarfAddressSpace: 0)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !185, file: !8, size: 192, align: 64, elements: !186, templateParams: !35, identifier: "7dd7f8bae5282d2529811e1abc63144f")
!185 = !DINamespace(name: "location", scope: !27)
!186 = !{!187, !188, !189}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !184, file: !8, baseType: !60, size: 128, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !184, file: !8, baseType: !89, size: 32, align: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !184, file: !8, baseType: !89, size: 32, align: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "can_unwind", scope: !25, file: !8, baseType: !191, size: 8, align: 8, offset: 256)
!191 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!192 = !{!193}
!193 = !DILocalVariable(name: "_panic", arg: 1, scope: !19, file: !20, line: 7, type: !24)
!194 = !DILocation(line: 7, column: 10, scope: !19)
!195 = !DILocation(line: 8, column: 5, scope: !19)
